In [1]:
import pandas as pd

pd.__version__

'1.0.3'

In [2]:
a = [1, 'a', None, True]

In [3]:
a

[1, 'a', None, True]

In [4]:
print(a[0])
print(a[3])

1
True

## Series

In [5]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [6]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [7]:
print(s['a'])
print(s['c'])
s[1]

3
7

-5

## DataFrame

In [8]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}

In [9]:
print(data['Country'])
data['Population']

['Belgium', 'India', 'Brazil']

[11190846, 1303171035, 207847528]

In [10]:
df = pd.DataFrame(data)
print(df)
pd.DataFrame(data, columns=['Country', 'Capital'])

Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

   Country    Capital
0  Belgium   Brussels
1    India  New Delhi
2   Brazil   Brasília

In [11]:
import numpy as np
data_dummy = pd.DataFrame(data=np.array([[1,'a',True], [2,'c',False]]), columns=['C1', 'C2', 'C3'])
data_dummy

  C1 C2     C3
0  1  a   True
1  2  c  False

## I/O

In [12]:
dataset = pd.read_csv('./jupyter/Cartwheeldata.csv')
dataset

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.00,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.00,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.00,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.00,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.00,75.0,72,N,0,4
5,6,24,M,2,N,0,75.00,71.0,81,N,0,3
6,7,28,M,2,N,0,75.00,76.0,107,Y,1,10
7,8,22,F,1,N,0,65.00,62.0,98,Y,1,9
8,9,29,M,2,Y,1,74.00,73.0,106,N,0,5
9,10,33,F,1,Y,1,63.00,60.0,65,Y,1,8
10,11,30,M,2,Y,1,69.50,66.0,96,Y,1,6
11,12,28,F,1,Y,1,62.75,58.0,79,Y,1,10
12,13,25,F,1,Y,1,65.00,64.5,92,Y,1,6
13,14,23,F,1,N,0,61.50,57.5,66,Y,1,4
14,15,31,M,2,Y,1,73.00,74.0,72,Y,1,9
15,16,26,M,2,Y,1,71.00,72.0,115,Y,1,6
16,17,26,F,1,N,0,61.50,59.5,90,N,0,10
17,18,27,M,2,N,0,66.00,66.0,74,Y,1,5
18,19,23,M,2,Y,1,70.00,69.0,64,Y,1,3
19,20,24,F,1,Y,1,68.00,66.0,85,Y,1,8
20,21,23,M,2,Y,1,69.00,67.0,66,N,0,2
21,22,29,M,2,N,0,71.00,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.00,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.00,71.0,63,Y,1,5
24,25,23,F,1,Y,1,65.00,63.0,67,N,0,3

In [13]:
data_dummy.to_csv('dummy.csv', index=None)

## INSPECT, SEARCH AND FILTER

In [14]:
print(dataset.shape)
print(dataset.shape[0])
print(dataset.shape[1])

(25, 12)
25
12

In [15]:
dataset.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

In [16]:
dataset.dtypes

ID                 int64
Age                int64
Gender            object
GenderGroup        int64
Glasses           object
GlassesGroup       int64
Height           float64
Wingspan         float64
CWDistance         int64
Complete          object
CompleteGroup      int64
Score              int64
dtype: object

In [17]:
dataset.head()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

In [18]:
dataset.tail()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
20,21,23,M,2,Y,1,69.0,67.0,66,N,0,2
21,22,29,M,2,N,0,71.0,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.0,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.0,71.0,63,Y,1,5
24,25,23,F,1,Y,1,65.0,63.0,67,N,0,3

In [19]:
dataset['Age'] # pd.Serie

0     56
1     26
2     33
3     39
4     27
5     24
6     28
7     22
8     29
9     33
10    30
11    28
12    25
13    23
14    31
15    26
16    26
17    27
18    23
19    24
20    23
21    29
22    25
23    26
24    23
Name: Age, dtype: int64

In [20]:
dataset[['Age']]  # Dataframe

    Age
0    56
1    26
2    33
3    39
4    27
5    24
6    28
7    22
8    29
9    33
10   30
11   28
12   25
13   23
14   31
15   26
16   26
17   27
18   23
19   24
20   23
21   29
22   25
23   26
24   23

In [21]:
# dataframe(condicion) = ...
dataset[dataset['Gender']=='M']

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4
5,6,24,M,2,N,0,75.0,71.0,81,N,0,3
6,7,28,M,2,N,0,75.0,76.0,107,Y,1,10
8,9,29,M,2,Y,1,74.0,73.0,106,N,0,5
10,11,30,M,2,Y,1,69.5,66.0,96,Y,1,6
14,15,31,M,2,Y,1,73.0,74.0,72,Y,1,9
15,16,26,M,2,Y,1,71.0,72.0,115,Y,1,6
17,18,27,M,2,N,0,66.0,66.0,74,Y,1,5
18,19,23,M,2,Y,1,70.0,69.0,64,Y,1,3
20,21,23,M,2,Y,1,69.0,67.0,66,N,0,2
21,22,29,M,2,N,0,71.0,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.0,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.0,71.0,63,Y,1,5

In [22]:
dataset[dataset['ID']==5]

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

## loc / iloc

In [23]:
# dataframe.loc[filtro_filas, filtro_columnas]
# OPERADORES CONDICIONES DENTRO DE DATAFRAME: &  |  ~
# Filtrar para: Genero=MUJERES / Edad>30 / Columnas: Height & CWDistance 
dataset.loc[(dataset['Gender']=='F') & 
            (dataset['Age']>30), ['Height', 'CWDistance']]# = 100.0

   Height  CWDistance
0    62.0          79
2    66.0          85
3    64.0          87
9    63.0          65

In [24]:
dataset.loc[(dataset['Gender']=='F') & 
            (dataset['Age']>30), :]

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
9,10,33,F,1,Y,1,63.0,60.0,65,Y,1,8

In [25]:
dataset.loc[:, ['Height', 'CWDistance']]

    Height  CWDistance
0    62.00          79
1    62.00          70
2    66.00          85
3    64.00          87
4    73.00          72
5    75.00          81
6    75.00         107
7    65.00          98
8    74.00         106
9    63.00          65
10   69.50          96
11   62.75          79
12   65.00          92
13   61.50          66
14   73.00          72
15   71.00         115
16   61.50          90
17   66.00          74
18   70.00          64
19   68.00          85
20   69.00          66
21   71.00         101
22   70.00          82
23   69.00          63
24   65.00          67

In [26]:
# x:y --> inicia en x: hasta antes de y
dataset.iloc[0:5, 3:6]

   GenderGroup Glasses  GlassesGroup
0            1       Y             1
1            1       Y             1
2            1       Y             1
3            1       N             0
4            2       N             0

## at / iat

In [27]:
dataset.at[5, 'Age']

24

In [28]:
dataset.iat[5, 8]

81

In [29]:
num_df = pd.DataFrame({'A':[1,2,3], 'B':[10,20,30], 'C':[9,8,7]})
num_df

   A   B  C
0  1  10  9
1  2  20  8
2  3  30  7

In [30]:
# tabla 1
num_df[num_df>8]
# tabla copia
df_copia = num_df[num_df>8].copy()

In [31]:
df_copia

    A   B    C
0 NaN  10  9.0
1 NaN  20  NaN
2 NaN  30  NaN

In [32]:
x = df_copia.loc[:, 'A']
x = 5
df_copia.loc[:, 'A'] = 5
print(x)
print(df_copia)

5
   A   B    C
0  5  10  9.0
1  5  20  NaN
2  5  30  NaN

In [33]:
print(pd.isna(df_copia))
pd.isna(df_copia).sum().sum()

A      B      C
0  False  False  False
1  False  False   True
2  False  False   True

2

In [34]:
df_copia.head()

   A   B    C
0  5  10  9.0
1  5  20  NaN
2  5  30  NaN

In [35]:
sum([1,2])

3

## Otra operaciones importantes

In [36]:
df = pd.DataFrame({'id':[1,2,3,4,5], 'Nombre':['A', 'B','C','D','E'], 'Edad':[12,20,33,51,92]})

In [37]:
df

   id Nombre  Edad
0   1      A    12
1   2      B    20
2   3      C    33
3   4      D    51
4   5      E    92

In [38]:
# Borrar columnas
df.drop(columns=['id','Nombre'])

   Edad
0    12
1    20
2    33
3    51
4    92

In [39]:
df = df.loc[~((df['Edad']>25) & (df['Edad']<35)), :]

In [40]:
df

   id Nombre  Edad
0   1      A    12
1   2      B    20
3   4      D    51
4   5      E    92

In [41]:
df.reset_index(drop=True)

   id Nombre  Edad
0   1      A    12
1   2      B    20
2   4      D    51
3   5      E    92

In [42]:
df['Ingresos'] = [100, 999, 20, 333]

In [43]:
df

   id Nombre  Edad  Ingresos
0   1      A    12       100
1   2      B    20       999
3   4      D    51        20
4   5      E    92       333

In [44]:
df.sort_values(['Ingresos']).sort_index()

   id Nombre  Edad  Ingresos
0   1      A    12       100
1   2      B    20       999
3   4      D    51        20
4   5      E    92       333

In [65]:
# Proceso
# df.loc[....].groupby(...).avg().reset_index().sort_values()

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        4 non-null      int64
 1   Nombre    4 non-null      object
 2   Edad      4 non-null      int64
 3   Ingresos  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 160.0+ bytes

In [47]:
df.count()

id          4
Nombre      4
Edad        4
Ingresos    4
dtype: int64

### Operaciones sobre columnas

In [48]:
df

   id Nombre  Edad  Ingresos
0   1      A    12       100
1   2      B    20       999
3   4      D    51        20
4   5      E    92       333

In [49]:
df['Ingresos'].sum()

1452

In [50]:
df['% Ingresos'] = round(df['Ingresos'] / df['Ingresos'].sum() * 100, 2)

In [51]:
df

   id Nombre  Edad  Ingresos  % Ingresos
0   1      A    12       100        6.89
1   2      B    20       999       68.80
3   4      D    51        20        1.38
4   5      E    92       333       22.93

In [52]:
df = df.sort_values(['Ingresos'], ascending=False).reset_index(drop=True)

In [53]:
df

   id Nombre  Edad  Ingresos  % Ingresos
0   2      B    20       999       68.80
1   5      E    92       333       22.93
2   1      A    12       100        6.89
3   4      D    51        20        1.38

In [54]:
df['% Ingresos Acum'] = round(df['Ingresos'].cumsum() / df['Ingresos'].sum() * 100, 2)

In [55]:
df

   id Nombre  Edad  Ingresos  % Ingresos  % Ingresos Acum
0   2      B    20       999       68.80            68.80
1   5      E    92       333       22.93            91.74
2   1      A    12       100        6.89            98.62
3   4      D    51        20        1.38           100.00

In [56]:
df['Ingresos'].min()

20

In [57]:
df['Ingresos'].max()

999

In [58]:
df.describe()

             id       Edad   Ingresos  % Ingresos  % Ingresos Acum
count  4.000000   4.000000    4.00000    4.000000         4.000000
mean   3.000000  43.750000  363.00000   25.000000        89.790000
std    1.825742  36.298531  444.30245   30.597393        14.452169
min    1.000000  12.000000   20.00000    1.380000        68.800000
25%    1.750000  18.000000   80.00000    5.512500        86.005000
50%    3.000000  35.500000  216.50000   14.910000        95.180000
75%    4.250000  61.250000  499.50000   34.397500        98.965000
max    5.000000  92.000000  999.00000   68.800000       100.000000

In [59]:
df['Ingresos'].mean()

363.0

In [60]:
df

   id Nombre  Edad  Ingresos  % Ingresos  % Ingresos Acum
0   2      B    20       999       68.80            68.80
1   5      E    92       333       22.93            91.74
2   1      A    12       100        6.89            98.62
3   4      D    51        20        1.38           100.00

In [61]:
# def funcion(x):
    # ...
    # ...
    # return result

f = lambda x: x**2
f(5)

25

In [62]:
# x es un valor de una celda de la columna elegida
df['Cat Ingresos'] = df['Ingresos'].apply(lambda x: 'Alto' if x > 500  else ('Regular' if x > 100 else 'Bajo'))

In [63]:
df

   id Nombre  Edad  Ingresos  % Ingresos  % Ingresos Acum Cat Ingresos
0   2      B    20       999       68.80            68.80         Alto
1   5      E    92       333       22.93            91.74      Regular
2   1      A    12       100        6.89            98.62         Bajo
3   4      D    51        20        1.38           100.00         Bajo

In [64]:
def ispar(x):
    if x%2==0:
        return 'Par'
    else:
        return 'Impar'

# df['Ingresos'].apply(lambda x: 'Par' if x % 2==0 else 'Impar')
df['Ingresos'].apply(ispar)

0    Impar
1    Impar
2      Par
3      Par
Name: Ingresos, dtype: object

In [67]:
df['Telf1'] = [np.nan, 12345, np.nan, 99999]
df['Telf2'] = [33333, 98765, np.nan, np.nan]
df

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2
0,2,B,20,999,68.80,68.80,Alto,NaN,33333.0
1,5,E,92,333,22.93,91.74,Regular,12345.0,98765.0
2,1,A,12,100,6.89,98.62,Bajo,NaN,NaN
3,4,D,51,20,1.38,100.00,Bajo,99999.0,NaN

In [70]:
# Cambiar el tipo de una columna
df['Telf1'].astype(str)

0        nan
1    12345.0
2        nan
3    99999.0
Name: Telf1, dtype: object

In [74]:
# row es una pd.Serie (col -> x = 0 / row -> x = 1)
def get_telefono_norm(row):
    if pd.isna(row['Telf1']):
        return row['Telf2']
    else:
        return row['Telf1']

# df['telefono_norm'] = df.apply(lambda row: row['Telf2'] if pd.isna(row['Telf1']) else row['Telf1'], axis=1)
df['telefono_norm'] = df.apply(get_telefono_norm, axis=1)

In [75]:
df

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm
0,2,B,20,999,68.80,68.80,Alto,NaN,33333.0,33333.0
1,5,E,92,333,22.93,91.74,Regular,12345.0,98765.0,12345.0
2,1,A,12,100,6.89,98.62,Bajo,NaN,NaN,NaN
3,4,D,51,20,1.38,100.00,Bajo,99999.0,NaN,99999.0

In [79]:
# NaN "op" X = NaN
df['Telf1'].fillna(0) + df['Telf2'].fillna(0)

0     33333.0
1    111110.0
2         0.0
3     99999.0
dtype: float64

In [81]:
df['Telf1'].mean()

56172.0

In [82]:
df['Telf1'].fillna(0).mean()

28086.0

# COMBINING DATA

## merge

In [84]:
df_compras = pd.DataFrame({'id': [2, 4, 99, 2],
                            'Prod': ['Cepillo', 'PH', 'Car', 'Entrada'],
                            'Precio': [1.5, 12, 5000, 300]
                            })

In [86]:
df

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm
0,2,B,20,999,68.80,68.80,Alto,NaN,33333.0,33333.0
1,5,E,92,333,22.93,91.74,Regular,12345.0,98765.0,12345.0
2,1,A,12,100,6.89,98.62,Bajo,NaN,NaN,NaN
3,4,D,51,20,1.38,100.00,Bajo,99999.0,NaN,99999.0

In [85]:
df_compras

   id     Prod  Precio
0   2  Cepillo     1.5
1   4       PH    12.0
2  99      Car  5000.0
3   2  Entrada   300.0

In [87]:
pd.merge(df, df_compras, how='left', on=['id'])

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm,Prod,Precio
0,2,B,20,999,68.80,68.80,Alto,NaN,33333.0,33333.0,Cepillo,1.5
1,2,B,20,999,68.80,68.80,Alto,NaN,33333.0,33333.0,Entrada,300.0
2,5,E,92,333,22.93,91.74,Regular,12345.0,98765.0,12345.0,NaN,NaN
3,1,A,12,100,6.89,98.62,Bajo,NaN,NaN,NaN,NaN,NaN
4,4,D,51,20,1.38,100.00,Bajo,99999.0,NaN,99999.0,PH,12.0

In [88]:
pd.merge(df, df_compras, how='right', on=['id'])

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm,Prod,Precio
0,2,B,20.0,999.0,68.80,68.8,Alto,NaN,33333.0,33333.0,Cepillo,1.5
1,2,B,20.0,999.0,68.80,68.8,Alto,NaN,33333.0,33333.0,Entrada,300.0
2,4,D,51.0,20.0,1.38,100.0,Bajo,99999.0,NaN,99999.0,PH,12.0
3,99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Car,5000.0

In [89]:
pd.merge(df, df_compras, how='inner', on=['id'])

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm,Prod,Precio
0,2,B,20,999,68.80,68.8,Alto,NaN,33333.0,33333.0,Cepillo,1.5
1,2,B,20,999,68.80,68.8,Alto,NaN,33333.0,33333.0,Entrada,300.0
2,4,D,51,20,1.38,100.0,Bajo,99999.0,NaN,99999.0,PH,12.0

In [90]:
pd.merge(df, df_compras, how='outer', on=['id'])

,id,Nombre,Edad,Ingresos,% Ingresos,% Ingresos Acum,Cat Ingresos,Telf1,Telf2,telefono_norm,Prod,Precio
0,2,B,20.0,999.0,68.80,68.80,Alto,NaN,33333.0,33333.0,Cepillo,1.5
1,2,B,20.0,999.0,68.80,68.80,Alto,NaN,33333.0,33333.0,Entrada,300.0
2,5,E,92.0,333.0,22.93,91.74,Regular,12345.0,98765.0,12345.0,NaN,NaN
3,1,A,12.0,100.0,6.89,98.62,Bajo,NaN,NaN,NaN,NaN,NaN
4,4,D,51.0,20.0,1.38,100.00,Bajo,99999.0,NaN,99999.0,PH,12.0
5,99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Car,5000.0

## concatenate

In [95]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']}) 

df2 = pd.DataFrame({'C': ['C4', 'C5', 'C6', 'C7'],
'D': ['D4', 'D5', 'D6', 'D7'],
'E': ['E4', 'E5', 'E6', 'E7'],
'F': ['F4', 'F5', 'F6', 'F7']})

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [97]:
df2

    C   D   E   F
0  C4  D4  E4  F4
1  C5  D5  E5  F5
2  C6  D6  E6  F6
3  C7  D7  E7  F7

In [103]:
pd.concat([df1, df2], ignore_index=True, sort=True, axis=0)

     A    B   C   D    E    F
0   A0   B0  C0  D0  NaN  NaN
1   A1   B1  C1  D1  NaN  NaN
2   A2   B2  C2  D2  NaN  NaN
3   A3   B3  C3  D3  NaN  NaN
4  NaN  NaN  C4  D4   E4   F4
5  NaN  NaN  C5  D5   E5   F5
6  NaN  NaN  C6  D6   E6   F6
7  NaN  NaN  C7  D7   E7   F7

In [108]:
pd.concat([df1, df2], ignore_index=False, sort=True, axis=1)#, verify_integrity=True)

    A   B   C   D   C   D   E   F
0  A0  B0  C0  D0  C4  D4  E4  F4
1  A1  B1  C1  D1  C5  D5  E5  F5
2  A2  B2  C2  D2  C6  D6  E6  F6
3  A3  B3  C3  D3  C7  D7  E7  F7